<?php
return [
    //key 是正则，value 这个正则会出现的结果，也是让他失败的结果。
    'bean' => [],
    'jdh' => [],
    'jdzz' => [
        '/[\x{4e00}-\x{9fa5}]/u' => true,  //不允许中文
        '/^[a-z_A-Z0-9-\.!@#\$%\\\^&\*\)\(\+=\{\}\[\]\/",<>~\·`\?:;|]+$/' => false  //允许英文+各种符号
    ],
    'jdcrazyjoy' => [
        '/[\x{4e00}-\x{9fa5}]/u' => true,  //不允许中文
        '/^[a-z_A-Z0-9-\.!@#\$%\\\^&\*\)\(\+=\{\}\[\]\/",<>~\·`\?:;|]+$/' => false  //允许英文+各种符号
    ],
    'jdbookshop' => [
        '/[\x{4e00}-\x{9fa5}]/u' => true,  //不允许中文
        '/^[a-z_A-Z0-9-\.!@#\$%\\\^&\*\)\(\+=\{\}\[\]\/",<>~\·`\?:;|]+$/' => false  //允许英文+各种符号
    ],
];
